CommunityGD32Cores/ArduinoCore-GD32/variants/GD32F103RF_GENERIC/PeripheralPins.c
/* PWM PinMap */
const PinMap PinMap_PWM[] = {
    {PORTA_0,       TIMER1,  GD_PIN_FUNC_PWM(0, DISABLE_TIMER1_FULL_REMAP)}, /* TIMER1_CH0 */
    {PORTA_0_ALT1,  TIMER1,  GD_PIN_FUNC_PWM(0, TIMER1_PARTIAL_REMAP1)}, /* TIMER1_CH0 */
    {PORTA_0_ALT2,  TIMER4,  GD_PIN_FUNC_PWM(0, 0)}, /* TIMER4_CH0 */
    {PORTA_1,       TIMER1,  GD_PIN_FUNC_PWM(1, DISABLE_TIMER1_FULL_REMAP)}, /* TIMER1_CH1 */
    {PORTA_1_ALT1,  TIMER1,  GD_PIN_FUNC_PWM(1, TIMER1_PARTIAL_REMAP1)}, /* TIMER1_CH1 */
    {PORTA_1_ALT2,  TIMER4,  GD_PIN_FUNC_PWM(1, 0)}, /* TIMER4_CH1 */
    {PORTA_2,       TIMER1,  GD_PIN_FUNC_PWM(2, DISABLE_TIMER1_FULL_REMAP)}, /* TIMER1_CH2 */
    {PORTA_2_ALT1,  TIMER1,  GD_PIN_FUNC_PWM(2, TIMER1_PARTIAL_REMAP0)}, /* TIMER1_CH2 */
    {PORTA_2_ALT2,  TIMER4,  GD_PIN_FUNC_PWM(2, 0)}, /* TIMER4_CH2 */
    {PORTA_2_ALT3,  TIMER8,  GD_PIN_FUNC_PWM(0, 0)}, /* TIMER8_CH0 */
    {PORTA_3,       TIMER1,  GD_PIN_FUNC_PWM(3, DISABLE_TIMER1_FULL_REMAP)}, /* TIMER1_CH3 */
    {PORTA_3_ALT1,  TIMER1,  GD_PIN_FUNC_PWM(3, TIMER1_PARTIAL_REMAP0)}, /* TIMER1_CH3 */
    {PORTA_3_ALT2,  TIMER4,  GD_PIN_FUNC_PWM(3, 0)}, /* TIMER4_CH3 */
    {PORTA_3_ALT3,  TIMER8,  GD_PIN_FUNC_PWM(1, 0)}, /* TIMER8_CH1 */
    {PORTA_6,       TIMER12, GD_PIN_FUNC_PWM(0, 0)}, /* TIMER12_CH0 */
    {PORTA_6_ALT1,  TIMER2,  GD_PIN_FUNC_PWM(0, DISABLE_TIMER2_FULL_REMAP)}, /* TIMER2_CH0 */
    {PORTA_7,       TIMER0,  GD_PIN_FUNC_PWM(0, TIMER0_PARTIAL_REMAP)}, /* TIMER0_CH0_ON */
    {PORTA_7_ALT1,  TIMER13, GD_PIN_FUNC_PWM(0, 0)}, /* TIMER13_CH0 */
    {PORTA_7_ALT2,  TIMER2,  GD_PIN_FUNC_PWM(1, DISABLE_TIMER2_FULL_REMAP)}, /* TIMER2_CH1 */
    {PORTA_7_ALT3,  TIMER7,  GD_PIN_FUNC_PWM(0, 0)}, /* TIMER7_CH0_ON */
    {PORTA_8,       TIMER0,  GD_PIN_FUNC_PWM(0, DISABLE_TIMER0_FULL_REMAP)}, /* TIMER0_CH0 */
    {PORTA_8_ALT1,  TIMER0,  GD_PIN_FUNC_PWM(0, TIMER0_PARTIAL_REMAP)}, /* TIMER0_CH0 */
    {PORTA_9,       TIMER0,  GD_PIN_FUNC_PWM(1, DISABLE_TIMER0_FULL_REMAP)}, /* TIMER0_CH1 */
    {PORTA_9_ALT1,  TIMER0,  GD_PIN_FUNC_PWM(1, TIMER0_PARTIAL_REMAP)}, /* TIMER0_CH1 */
    {PORTA_10,      TIMER0,  GD_PIN_FUNC_PWM(2, DISABLE_TIMER0_FULL_REMAP)}, /* TIMER0_CH2 */
    {PORTA_10_ALT1, TIMER0,  GD_PIN_FUNC_PWM(2, TIMER0_PARTIAL_REMAP)}, /* TIMER0_CH2 */
    {PORTA_11,      TIMER0,  GD_PIN_FUNC_PWM(3, DISABLE_TIMER0_FULL_REMAP)}, /* TIMER0_CH3 */
    {PORTA_11_ALT1, TIMER0,  GD_PIN_FUNC_PWM(3, TIMER0_PARTIAL_REMAP)}, /* TIMER0_CH3 */
    {PORTA_15,      TIMER1,  GD_PIN_FUNC_PWM(0, TIMER1_PARTIAL_REMAP0)}, /* TIMER1_CH0 */
    {PORTA_15_ALT1, TIMER1,  GD_PIN_FUNC_PWM(0, TIMER1_FULL_REMAP)}, /* TIMER1_CH0 */
    {PORTB_0,       TIMER0,  GD_PIN_FUNC_PWM(1, TIMER0_PARTIAL_REMAP)}, /* TIMER0_CH1_ON */
    {PORTB_0_ALT1,  TIMER2,  GD_PIN_FUNC_PWM(2, DISABLE_TIMER2_FULL_REMAP)}, /* TIMER2_CH2 */
    {PORTB_0_ALT2,  TIMER2,  GD_PIN_FUNC_PWM(2, TIMER2_PARTIAL_REMAP)}, /* TIMER2_CH2 */
    {PORTB_0_ALT3,  TIMER7,  GD_PIN_FUNC_PWM(1, 0)}, /* TIMER7_CH1_ON */
    {PORTB_1,       TIMER0,  GD_PIN_FUNC_PWM(2, TIMER0_PARTIAL_REMAP)}, /* TIMER0_CH2_ON */
    {PORTB_1_ALT1,  TIMER2,  GD_PIN_FUNC_PWM(3, DISABLE_TIMER2_FULL_REMAP)}, /* TIMER2_CH3 */
    {PORTB_1_ALT2,  TIMER2,  GD_PIN_FUNC_PWM(3, TIMER2_PARTIAL_REMAP)}, /* TIMER2_CH3 */
    {PORTB_1_ALT3,  TIMER7,  GD_PIN_FUNC_PWM(2, 0)}, /* TIMER7_CH2_ON */
    {PORTB_3,       TIMER1,  GD_PIN_FUNC_PWM(1, TIMER1_PARTIAL_REMAP0)}, /* TIMER1_CH1 */
    {PORTB_3_ALT1,  TIMER1,  GD_PIN_FUNC_PWM(1, TIMER1_FULL_REMAP)}, /* TIMER1_CH1 */
    {PORTB_4,       TIMER2,  GD_PIN_FUNC_PWM(0, TIMER2_PARTIAL_REMAP)}, /* TIMER2_CH0 */
    {PORTB_5,       TIMER2,  GD_PIN_FUNC_PWM(1, TIMER2_PARTIAL_REMAP)}, /* TIMER2_CH1 */
    {PORTB_6,       TIMER3,  GD_PIN_FUNC_PWM(0, 0)}, /* TIMER3_CH0 */
    {PORTB_7,       TIMER3,  GD_PIN_FUNC_PWM(1, 0)}, /* TIMER3_CH1 */
    {PORTB_8,       TIMER3,  GD_PIN_FUNC_PWM(2, 0)}, /* TIMER3_CH2 */
    {PORTB_8_ALT1,  TIMER9,  GD_PIN_FUNC_PWM(0, 0)}, /* TIMER9_CH0 */
    {PORTB_9,       TIMER10, GD_PIN_FUNC_PWM(0, 0)}, /* TIMER10_CH0 */
    {PORTB_9_ALT1,  TIMER3,  GD_PIN_FUNC_PWM(3, 0)}, /* TIMER3_CH3 */
    {PORTB_10,      TIMER1,  GD_PIN_FUNC_PWM(2, TIMER1_PARTIAL_REMAP1)}, /* TIMER1_CH2 */
    {PORTB_10_ALT1, TIMER1,  GD_PIN_FUNC_PWM(2, TIMER1_FULL_REMAP)}, /* TIMER1_CH2 */
    {PORTB_11,      TIMER1,  GD_PIN_FUNC_PWM(3, TIMER1_PARTIAL_REMAP1)}, /* TIMER1_CH3 */
    {PORTB_11_ALT1, TIMER1,  GD_PIN_FUNC_PWM(3, TIMER1_FULL_REMAP)}, /* TIMER1_CH3 */
    {PORTB_13,      TIMER0,  GD_PIN_FUNC_PWM(0, DISABLE_TIMER0_FULL_REMAP)}, /* TIMER0_CH0_ON */
    {PORTB_14,      TIMER0,  GD_PIN_FUNC_PWM(1, 0)}, /* TIMER0_CH1_ON */
    {PORTB_14_ALT1, TIMER11, GD_PIN_FUNC_PWM(0, 0)}, /* TIMER11_CH0 */
    {PORTB_15,      TIMER0,  GD_PIN_FUNC_PWM(2, 0)}, /* TIMER0_CH2_ON */
    {PORTB_15_ALT1, TIMER11, GD_PIN_FUNC_PWM(1, 0)}, /* TIMER11_CH1 */
    {PORTC_6,       TIMER2,  GD_PIN_FUNC_PWM(0, TIMER2_FULL_REMAP)}, /* TIMER2_CH0 */
    {PORTC_6_ALT1,  TIMER7,  GD_PIN_FUNC_PWM(0, 0)}, /* TIMER7_CH0 */
    {PORTC_7,       TIMER2,  GD_PIN_FUNC_PWM(1, TIMER2_FULL_REMAP)}, /* TIMER2_CH1 */
    {PORTC_7_ALT1,  TIMER7,  GD_PIN_FUNC_PWM(1, 0)}, /* TIMER7_CH1 */
    {PORTC_8,       TIMER2,  GD_PIN_FUNC_PWM(2, TIMER2_FULL_REMAP)}, /* TIMER2_CH2 */
    {PORTC_8_ALT1,  TIMER7,  GD_PIN_FUNC_PWM(2, 0)}, /* TIMER7_CH2 */
    {PORTC_9,       TIMER2,  GD_PIN_FUNC_PWM(3, TIMER2_FULL_REMAP)}, /* TIMER2_CH3 */
    {PORTC_9_ALT1,  TIMER7,  GD_PIN_FUNC_PWM(3, 0)}, /* TIMER7_CH3 */
    {NC,   NC,    0}
};

/* UART_TX PinMap */
const PinMap PinMap_UART_TX[] = {
    {PORTA_2,       USART1, PIN_MODE_AF_PP},       /* USART1_TX */
    {PORTA_9,       USART0, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OTYPE_PP, PIN_PUPD_PULLUP, DISABLE_USART0_REMAP)}, /* USART0_TX */
    {PORTB_6,       USART0, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OTYPE_PP, PIN_PUPD_PULLUP, USART0_REMAP)}, /* USART0_TX */
    {PORTB_10,      USART2, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OTYPE_PP, PIN_PUPD_PULLUP, DISABLE_USART2_FULL_REMAP)}, /* USART2_TX */
    {PORTC_10,      UART3, PIN_MODE_AF_PP},        /* UART3_TX */
    {PORTC_10_ALT1, USART2, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OTYPE_PP, PIN_PUPD_PULLUP, USART2_PARTIAL_REMAP)}, /* USART2_TX */
    {PORTC_12,      UART4, PIN_MODE_AF_PP},        /* UART4_TX */
    {NC,   NC,    0}
};

/* UART_RX PinMap */
const PinMap PinMap_UART_RX[] = {
    {PORTA_3,       USART1, GPIO_MODE_IN_FLOATING}, /* USART1_RX */
    {PORTA_10,      USART0, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OTYPE_PP, PIN_PUPD_PULLUP, DISABLE_USART0_REMAP)}, /* USART0_RX */
    {PORTB_7,       USART0, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OTYPE_PP, PIN_PUPD_PULLUP, USART0_REMAP)}, /* USART0_RX */
    {PORTB_11,      USART2, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OTYPE_PP, PIN_PUPD_PULLUP, DISABLE_USART2_FULL_REMAP)}, /* USART2_RX */
    {PORTC_11,      UART3, GPIO_MODE_IN_FLOATING}, /* UART3_RX */
    {PORTC_11_ALT1, USART2, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OTYPE_PP, PIN_PUPD_PULLUP, USART2_PARTIAL_REMAP)}, /* USART2_RX */
    {PORTD_2,       UART4, GPIO_MODE_IN_FLOATING}, /* UART4_RX */
    {NC,   NC,    0}
};

/* UART_RTS PinMap */
const PinMap PinMap_UART_RTS[] = {
    {PORTA_1,       USART1, GPIO_MODE_AF_PP},      /* USART1_RTS */
    {PORTA_12,      USART0, GPIO_MODE_AF_PP},      /* USART0_RTS */
    {PORTB_14,      USART2, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OTYPE_PP, PIN_PUPD_PULLUP, DISABLE_USART2_FULL_REMAP)}, /* USART2_RTS */
    {PORTB_14_ALT1, USART2, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OTYPE_PP, PIN_PUPD_PULLUP, USART2_PARTIAL_REMAP)}, /* USART2_RTS */
    {NC,   NC,    0}
};

/* UART_CTS PinMap */
const PinMap PinMap_UART_CTS[] = {
    {PORTA_0,       USART1, GPIO_MODE_AF_PP},      /* USART1_CTS */
    {PORTA_11,      USART0, GPIO_MODE_AF_PP},      /* USART0_CTS */
    {PORTB_13,      USART2, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OTYPE_PP, PIN_PUPD_PULLUP, DISABLE_USART2_FULL_REMAP)}, /* USART2_CTS */
    {PORTB_13_ALT1, USART2, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OTYPE_PP, PIN_PUPD_PULLUP, USART2_PARTIAL_REMAP)}, /* USART2_CTS */
    {NC,   NC,    0}
};

/* SPI_MOSI PinMap */
const PinMap PinMap_SPI_MOSI[] = {
    {PORTA_7,       SPI0, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OTYPE_PP, PIN_PUPD_PULLUP, DISABLE_SPI0_REMAP)}, /* SPI0_MOSI */
    {PORTB_5,       SPI0, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OTYPE_PP, PIN_PUPD_PULLUP, SPI0_REMAP)}, /* SPI0_MOSI */
    {PORTB_5_ALT1,  SPI2, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OTYPE_PP, PIN_PUPD_PULLUP, DISABLE_SPI0_REMAP)}, /* SPI2_MOSI */
    {PORTB_15,      SPI1, GPIO_MODE_AF_PP},        /* SPI1_MOSI */
    {PORTC_12,      SPI2, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OTYPE_PP, PIN_PUPD_PULLUP, SPI0_REMAP)}, /* SPI2_MOSI */
    {NC,   NC,    0}
};

